---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarConstraintType
source: html/b9417455-214c-30ef-e055-ad17ff1e0db3.htm
---
# Autodesk.Revit.DB.Structure.RebarConstraintType

The various types of constraints that can be applied to a RebarConstrainedHandle.

## Syntax (C#)
```csharp
public enum RebarConstraintType
```